app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
	def new
    @question = Question.find(params[:question_id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
INSERT INTO "answers" ("is_true", "sign", "content", "created_at", "updated_at", "question_id") VALUES (?, ?, ?, ?, ?, ?)  [["is_true", "t"], ["sign", "123"], ["content", "123"], ["created_at", "2017-08-28 10:36:27.379725"], ["updated_at", "2017-08-28 10:36:27.379725"], ["question_id", 31]]
---
	def create
		@question = Question.find(params[:question_id])
		@question.answers.create(answer_params)