app/controllers/papers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @paper = Paper.new(paper_params)
    @paper.user_id = User.find(params[:user_id]).id

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @user = User.find(params[:user_id])