app/controllers/papers_controller.rb

SELECT "papers".* FROM "papers"
---
  def index
    @papers = Paper.all

INSERT INTO "papers" ("name", "title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "123"], ["title", "123"], ["description", "123"], ["user_id", 1], ["created_at", "2017-06-14 06:34:05.094643"], ["updated_at", "2017-06-14 06:34:05.094643"]]
---
  def create
    @paper = Paper.new(paper_params)
    @paper.save

SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @paper = Paper.find(params[:id])

SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @paper = Paper.find(params[:id])

SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "papers" SET "description" = ?, "updated_at" = ? WHERE "papers"."id" = ?  [["description", "123"], ["updated_at", "2017-08-07 17:11:54.123918"], ["id", 1]]
---
  def update
    @paper = Paper.find(params[:id])
    @paper.update(paper_params)