app/controllers/questions_controller.rb

  def index
    @questions = Paper.find(params[:paper_id]).questions
---
SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."paper_id" = ? LIMIT ?  [["paper_id", 2], ["LIMIT", 11]]

  def new
    @paper = Paper.find(params[:paper_id])
---
SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    redirect_to action: 'show', id: Paper.find(params[:paper_id]).questions.create(question_params).id
---
INSERT INTO "questions" ("title", "tag", "body", "answer", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "123"], ["tag", "123"], ["body", "123"], ["answer", "123"], ["user_id", 1], ["created_at", "2017-06-13 08:40:09.233045"], ["updated_at", "2017-06-13 08:40:09.233045"]]
SELECT  "papers".* FROM "papers" WHERE "papers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."paper_id" = ? LIMIT ?  [["paper_id", 1], ["LIMIT", 11]]

  def show
		console
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

  def update
    Question.find(params[:id]).update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
UPDATE "questions" SET "title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "dasdmad"], ["updated_at", "2017-08-15 10:27:36.008294"], ["id", 34]]