app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "q"], ["description", "q"], ["created_at", "2017-06-13 08:04:23.578167"], ["updated_at", "2017-06-13 08:04:23.578167"]]