app/controllers/welcome_controller.rb

SELECT "papers".* FROM "papers"
---
  def index
		@papers = Paper.all